{
  "main": {
    "name":"Riken Gala",
    "occupation":"Software Engineer",
    "description":"I am a budding software engineer with experience in Web and Mobile Development. I am also very interested in Blockchain and its use-cases in the financial domain. I am aspiring to work for a company in the Finance domain and work there as a Software Engineer/Tech Consultant",
    "image":"IMG_2804.jpg",
    "bio":"I am a budding software engineer with experience in Web and Mobile Development. I am also very interested in Blockchain and its use-cases in the financial domain. I am aspiring to work for a company in the Finance domain and work there as a Software Engineer/Tech Consultant",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "rikengala@gmail.com",
    "phone": "+1 - (631) 710 9591",
    "address":{
      "city":"Jersey City",
      "state":"New Jersey"
      
    },
    "website": "http://rikengala.github.io/",
    "resumedownload":"https://drive.google.com/uc?export=download&id=1WrO8hM9pxYOuWQeNy8EwviPXccT0fFom",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/rikengala98",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/riken-gala-81a54b9a/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/rikengala",
        "className":"fa fa-github"
      }
      
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"Stony Brook University",
        "degree":"Masters of Science in Computer Science",
        "graduated":"Dec 2022(expected)",
      "description":"I pursued a Masters degree in Computer Science at Stony Brook University, New York. I have a cumulative GPA of 3.5/4/0. Relevant Coursework - Machine Learning, Computer Vision, Data Science Fundamentals, Human Computer Interaction, Logic in Computer Science"
      },
      {
        "school":"Dwarkadas J Sanghvi College of Engineering",
        "degree":"Bachelors in Engineering",
        "graduated":"Oct 2020",
        "description":"I have pursued a Bachelors degree in Engineering with a major in Information Technology. I graduated with a CGPA of 8.8/10. I was also the Vice-Chairperson of the 'Computer Society of India' which aimed to help other students improve their skills in coding and help increase their knowldege in computer science by taking part in projects"
      }
    ],
    "work":[
      {
        "company": "Meta Platforms Inc",
        "title": "Software Engineer Intern",
        "years": "May 2022 - Aug 2022",
        "description": "I worked at Meta as a Full Stack Developer with the Personalized Ads team. I implemented an internal tool to preview advertisement content using data from the content bank before pushing it to production which directly helped multiple cross-functional teams around Meta."
      },
      {
        "company":"Northstar Innovations",
        "title":"React Native Developer",
        "years":"Aug 2020 - Oct 2020",
        "description": "As a React Native developer at Northstar Innovations, I worked on a Student Relationship Management application for schools. The app included features to automate and efficiently handle school tasks like Attendance Management, Leave Management, updating student, teacher and parent information. The app also had additional features like Bus Tracking, Chat, Reminders for Events and Homework"
      },
      {
        "company":"Cateina Technologies",
        "title":"Intern",
        "years":"March 2019 - March 2020",
        "description": "Developed a mobile application using React Native to allow customers to manage their loyalty points. I also interfaced REST APIs for partner companies to retrieve data using Node JS and designed API documentation using Swagger. THe management of loyalty points is powered using the Stellar blockchain which allows customers to transfer and exchange loyalty points"
      },
      {
        "company":"Birthvenue",
        "title":"Intern",
        "years":"February 2019 - February 2020",
        "description":"Buit a web application using React and Flask to showcase ratings of different cryptocurrencies. Analyzed and identified parameters to rate crypto currencies and assisted in conceptualizing a rating algorithm for cryptocurrency investors."
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"80%"
      },
      {
        "name":"Javascript",
        "level":"80%"
      },
      {
        "name":"ReactJs",
        "level":"60%"
      },
      {
        "name":"CSS",
        "level":"70%"
      },
      {
        "name":"HTML5",
        "level":"70%"
      },
      {
        "name":"NodeJS",
        "level":"50%"
      },
      {
        "name":"MongoDB",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Blockchain-based Universal Loyalty Platform",
        "category":"A React Native App used for management of loyalty points",
        "image":"loyaltypoints.jpg",
        "url":"https://github.com/divyaamin9825/LoyaltyProgram"
      },
      {
        "title":"Coin Ratings",
        "category":"Crypto-currency rating tool",
        "image":"bitcoin.jpeg",
        "url":"https://www.theratingproject.com"
      },
      {
        "title":"Parkinson’s Disease Monitoring App",
        "category":"An interactive remote monitoring platform that incorporates both motor and cognitive tasks aimed to provide high frequency monitoring of symptoms and activities of daily living related to Parkinson's Disease.",
        "image":"resume-website.png",
        "url":"https://github.com/shubham-j/Parkinson-s-Disease-Motor-Sensing-App"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Riken is an excellent engineer with whom I had the pleasure of working to improve features on our internal Content Management Tool. Riken decided to join our team as a summer intern. His biggest strength I would say is he is open to feedback & implements them asap to help himself grow. He also understands the requirement quickly and unblocks self through the various resources & tools when executing. Riken was able to onboard onto using some of our internal frameworks with ease & shared his learnings later with broader team. He actively participated in team social events & was easy to work with/help based on other team members feedback. I highly recommend Riken if you need to get the job done!",
        "user":"Abhijith Nair (Manager at Meta)"
      },
      {
        "text":"Working with Riken has been an absolute pleasure. He has the strong programming fundamentals required of a software engineer while also having the communication and proactivity of a great team player.While at Meta, we collaborated substantially and I was thoroughly impressed by his ability to jump right into any challenge and independently find the most effective solution to any blocker - be it web development, databases, or cross-functional collaboration. I strongly recommend him and I would unhesitatingly take up the opportunity to work with him again.",
        "user":"Eric Parton (Mentor at Meta)"
      }
    ]
  }
}
